Repository: PRO-BHFS/BHF-Player
Catalog: lib/l10n/intl_*.arb
Languages: ar

# app_title
source: BHF Player
ar: مشغل BHF

source: Import
ar: استيراد

source: Courses
ar: الدورات

source: Language
ar: اللغة

source: Import a File
ar: استيراد ملف

source: Choose Encrypted File
ar: اختر ملف مشفر

source: Play Video
ar: تشغيل الفيديو

source: Add Course
ar: إضافة دورة

source: Edit Course
ar: تعديل الدورة

source: Delete Course
ar: حذف الدورة

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Add New Course
ar: إضافة دورة جديدة

# edit_course_title
source: Edit Course
ar: تعديل الدورة

source: Course Name
ar: اسم الدورة

source: Password
ar: الباسورد

# enter_course_name
source: Enter course name here
ar: اكتب اسم الدورة هنا

# enter_password
source: Enter password here
ar: اكتب الباسورد هنا

# title_duplicated
source: Title is duplicated
ar: العنوان مكرر

source: No courses added yet
ar: لم يتم اضافة دورات بعد

source: Choose Training Course
ar: اختر الدورة التدريبية

source: No videos
ar: لا يوجد فيدوهات

source: Videos
ar: فيديو

source: Settings
ar: الاعدادات

source: Dark Mode
ar: الوضع المظلم

source: Change Language
ar: تغيير اللغة

source: About Us
ar: حول

source: Save Backup
ar: حفظ نسخة

source: Restore Backup
ar: استعادة نسخة

# settings_title
source: Settings
ar: الإعدادات

source: File imported successfully
ar: تم استيراد الملف بنجاح

source: Selected:
ar: تم اختيار:

source: No file selected yet
ar: لم يتم اختيار اي ملف حتى الان

source: Course added successfully
ar: تم اضافة دورة بنجاح

source: Course deleted successfully
ar: تم حذف دورة بنجاح

source: Course updated successfully
ar: تم تعديل الدورة بنجاح

source: Confirm Delete
ar: تأكيد الحذف

# are_you_sure_delete_course
source: Are you sure you want to delete course:
ar: هل أنت متأكد أنك تريد حذف دورة:

source: Cannot undo this action
ar: لا يمكن التراجع عن هذه العملية.

source: Backup saved successfully
ar: تم حفظ نسخة احتياطية من البيانات بنجاح

# error_occurred_while_saving
source: Error occurred while saving data
ar: حدث خطأ أثناء حفظ البيانات

source: Data restored successfully
ar: تم استعادة البيانات بنجاح

# error_occurred_while_restoring
source: Error occurred while restoring data
ar: حدث خطأ أثناء استعادة البيانات

source: ID:
ar: المعرف:

# file_save_error
source: File not saved
ar: لم يتم الحفظ

source: Password incorrect
ar: الباسورد غير صحيح

# cannot_play_video
source: Cannot play this video
ar: لايمكنك تشغيل هذا الملف

source: Decryption failed
ar: فشل في عملية فك التشفير

# decrypted_path_invalid
source: Decrypted video path is invalid
ar: مسار الفيديو المفكوك غير صالح

source: No video in path
ar: لا يوجد فيديو في المسار

# cannot_play_video_error
source: Cannot play video
ar: لا يمكنك تشغيل الفيديو

# decryption_problem
source: Decryption problem occurred
ar: حدثت مشكلة اثناء فك التشفير

source: File not found
ar: الملف غير موجود

# iv_extraction_error
source: Error while extracting IV
ar: خطأ أثناء استخراج IV

source: Invalid message
ar: رسالة غير صالحة

source: Decryption failed for chunk
ar: فشل فك التشفير للشريحة رقم

# video_playback_error
source: Video playback error occurred
ar: حدث خطأ أثناء تشغيل الفيديو

# database_not_initialized
source: Database not initialized successfully
ar: لم يتم تهيئة البيانات بنجاح

source: Final file write failed
ar: فشل كتابة الملف النهائي

# file_read_error
source: File read error occurred
ar: حدث خطأ أثناء قراءة الملف

source: Field cannot be empty
ar: لايمكن ان يكون الحقل فارغا

source: Field cannot contain only spaces
ar: لا يمكن ان يحتوي الحقل على مسافات فقط

source: Save Backup File As
ar: حفظ نسخة احتياطية باسم

# open_shared_file_error
source: Error: Can not Open this Shared File
ar: حدث خطأ عند محاولة فتح الملف الذي تمت مشاركته أو فتحه عبر التطبيق

# error_generate_qr_code
source: An Error Occurred While Generating QR Code.
ar: حدث خطأ اثناء توليد QR Code

source: Generate QR Code
ar: QR Code توليد

# title_password_scanner
source: Password Scanner
ar: ماسح كلمة المرور

# msg_scan_instruction
source: Let the scan do the magic. It starts on its own!
ar: ضع رمز QR داخل الإطار، وسيتم مسحه تلقائيًا!
